In [1]:
#For DataFrame 
import pandas as pd
import numpy as np
#For json file
import json
#For SQL
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

# Create The Movies Database

In [2]:
#Import the password for the database 
with open(r'C:\Users\llozi\Documents\coding DoJo\.secret\pd.json') as f:
    login = json.load(f)
# Making the link for database
connection_str = f"mysql+pymysql://root:{login['password']}@localhost/movies"

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [37]:
#Create the engine
engine = create_engine(connection_str)

# Creating Table For the Database

In [32]:
#importing dataframe
basics_df = pd.read_csv("Data/clean_basics_df.csv.gz", low_memory = False)
rate_df = pd.read_csv("Data/clean_rate_df.csv.gz", low_memory = False)
tmdb_df = pd.read_csv("Data/tmdb_data.csv.gz", low_memory = False)

In [38]:
#displaying all the Dataframe
display(basics_df.head())
display(rate_df.head())
display(tmdb_df.head())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

      tconst  averageRating  numVotes
0  tt0000001            5.7      1922
1  tt0000002            5.8       259
2  tt0000003            6.5      1733
3  tt0000004            5.6       174
4  tt0000005            6.2      2544

     imdb_id     revenue      budget certification
0  tt0118694  12854953.0    150000.0            PG
1  tt0118852         0.0         0.0             R
2  tt0119273         0.0  15000000.0             R
3  tt0119495         0.0         0.0             R
4  tt0120467     14904.0    120000.0             R

In [39]:
## create a col with a list of genres
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [41]:
#Get all the type of genres
exploded_genres = basics_df.explode('genres_split')
unique_genres = sorted(exploded_genres['genres_split'].unique())
print(unique_genres)

['Action', 'Adult', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama', 'Family', 'Fantasy', 'Game-Show', 'History', 'Horror', 'Music', 'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi', 'Short', 'Sport', 'Talk-Show', 'Thriller', 'War', 'Western']

In [43]:
#making title_genres 
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [10]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
print(genre_map)

{'Action': 0, 'Adult': 1, 'Adventure': 2, 'Animation': 3, 'Biography': 4, 'Comedy': 5, 'Crime': 6, 'Drama': 7, 'Family': 8, 'Fantasy': 9, 'Game-Show': 10, 'History': 11, 'Horror': 12, 'Music': 13, 'Musical': 14, 'Mystery': 15, 'News': 16, 'Reality-TV': 17, 'Romance': 18, 'Sci-Fi': 19, 'Short': 20, 'Sport': 21, 'Talk-Show': 22, 'Thriller': 23, 'War': 24, 'Western': 25}

In [11]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [44]:
## mapping the 'genres_split' column then dropping it
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [13]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
83396  tt9916190         0
83396  tt9916190         2
83396  tt9916190        23
83397  tt9916362         7
83397  tt9916362        11

[155853 rows x 2 columns]

In [14]:
print(genre_map.keys())

dict_keys(['Action', 'Adult', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama', 'Family', 'Fantasy', 'Game-Show', 'History', 'Horror', 'Music', 'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi', 'Short', 'Sport', 'Talk-Show', 'Thriller', 'War', 'Western'])

In [15]:
#making genres_df dataframe
genres_df = pd.DataFrame({'genre_name':genre_map.keys(),'genre_id':genre_map.values()})
genres_df

    genre_name  genre_id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

In [16]:
basics_df= basics_df[["tconst","primaryTitle","startYear","endYear","runtimeMinutes"]]

In [17]:
rate_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1922
1  tt0000002            5.8       259
2  tt0000003            6.5      1733
3  tt0000004            5.6       174
4  tt0000005            6.2      2544

# Export  Tables to Database

## Export title_ratings to Database

In [20]:
# Calculate max string lengths for object columns
key_len = rate_df['tconst'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float(),}

rate_df.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

1245557

In [21]:
#Making PRIMARY KEY
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

## Export title_basics to Database

In [22]:
# Calculate max string lengths for object columns
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

basics_df.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

83398

In [23]:
#Making PRIMARY KEY
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Export title_genres to Database

In [24]:
## Calculate max string lengths for object columns
key_len = title_genres ['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

155853

## Export genres to Database

In [25]:
## Calculate max string lengths for object columns
name_len = genres_df['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "'genre_name'":Text(name_len+1), 
    'genre_id':Integer()}

genres_df.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

26

In [26]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY ( genre_id);')

## Export tmdb_data to Database

In [34]:
## Calculate max string lengths for object columns
key_len = tmdb_df['imdb_id'].fillna('').map(len).max()
title_len = tmdb_df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'revenue':Float(),
    'budget':Float()}

tmdb_df.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

798

In [35]:
#Making PRIMARY KEY
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY ( imdb_id);')

# Checking the table in the database

### title_basics

### title_ratings

In [50]:
q = """SELECT * 
 FROM title_ratings
LIMIT 5; """
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1922.0
1  tt0000002            5.8     259.0
2  tt0000003            6.5    1733.0
3  tt0000004            5.6     174.0
4  tt0000005            6.2    2544.0

### title_genres

In [51]:
q = """SELECT * 
 FROM title_genres
LIMIT 5; """
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### genres

In [52]:
q = """SELECT * 
 FROM genres
LIMIT 5; """
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data

In [53]:
q = """SELECT * 
 FROM tmdb_data
LIMIT 5; """
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0118589   5271670.0  22000000.0         PG-13
2  tt0118652         0.0   1000000.0             R
3  tt0118694  12855000.0    150000.0            PG
4  tt0118852         0.0         0.0             R

## Show Table

In [55]:
q = """SHOW TABLES """
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data